Tekla.Structures.AnalysisInternal.dotADResultValue_t
Serialization structure for analysis result value

Tekla.Structures.AnalysisInternal.dotADResultValue_t.ObjectType
ObjectType

Tekla.Structures.AnalysisInternal.dotADResultValue_t.ObjectId
ObjectId

Tekla.Structures.AnalysisInternal.dotADResultValue_t.LoadCaseId
Load case ID (database ID)

Tekla.Structures.AnalysisInternal.dotADResultValue_t.Position
Position

Tekla.Structures.AnalysisInternal.dotADResultValue_t.PositionCoordX
PositionCoordX

Tekla.Structures.AnalysisInternal.dotADResultValue_t.PositionCoordY
PositionCoordY

Tekla.Structures.AnalysisInternal.dotADResultValue_t.PositionCoordZ
PositionCoordZ

Tekla.Structures.AnalysisInternal.dotADResultValue_t.PositionTolerance
PositionTolerance

Tekla.Structures.AnalysisInternal.dotADResultValue_t.Value
Value

Tekla.Structures.AnalysisInternal.dotADResultValue_t.ValueType
ValueType

Tekla.Structures.AnalysisInternal.dotADResultValue_t.ModId
ModId